#
# aiq/aie 开始程序
#

########################################################################################################################
# 资源准备 #

###########
# 第三方库 #
##########
import pickle
############
# 自创建模块 #
############
import first_start_guide

#########
# 变量池 #
########

########################################################################################################################
# 开始程序 #
##########
def aiq_start():

    ### 读取文件 ###
    try:
        with open('config.ppp', 'rb') as f:
            config = pickle.load(f)
    except:
        # 读取失败，重新创建
        print('配置文件读取失败.')
        print('可能是第一次启动，亦或者是文件损坏.')
        print('点击Enter创建（新的）配置文件...')
        input('>|')
        config = first_start_guide.guide()
        print('初始化...')
        print('>|')
    print(config)

if __name__ == '__main__':
    aiq_start()